---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.WallJoinFailures.FailedToChangeWallJointsTypeFailure
source: html/076d7999-c933-38ad-a225-f24832d1942f.htm
---
# Autodesk.Revit.DB.BuiltInFailures.WallJoinFailures.FailedToChangeWallJointsTypeFailure Property

Some of the joints you have selected can only have one wall joint type, so these joints haven't been changed.

## Syntax (C#)
```csharp
public static FailureDefinitionId FailedToChangeWallJointsTypeFailure { get; }
```